АлогистикТест2/src/Documents/алк_ЗаказНаПроизводство/алк_ЗаказНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗаказНаПроизводство</name>
  <basedOn>Document.алк_ЗаказПокупателя</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПоЗаказуПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аддендумы</name>
    <attributes>
      <name>Аддендум</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВПроизводство</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗаказНаПроизводство/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПроцедурыЗаполненияДокумента
	
	// Процедура - обработчик события ОбработкаЗаполнения.
	//
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
			
			Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
				ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
			КонецЕсли; 
			
		Иначе
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.алк_ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
		КонецЕсли; 
				
	КонецПроцедуры
	
		// Обработчик заполнения документа по структуре
	//
	// Параметры:
	//
	Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
		
		//Если ДанныеЗаполнения.Свойство("Основание") Тогда
		//	
		//КонецЕсли;
		
		//Если ДанныеЗаполнения.Свойство("Заказ") Тогда
		//	Заказ = ДанныеЗаполнения.Заказ;	
		//КонецЕсли; 
		//
		//Если ДанныеЗаполнения.Свойство("ВидТранспортировки") Тогда
		//	ВидТранспортировки = ДанныеЗаполнения.ВидТранспортировки;	
		//КонецЕсли;	
		
	КонецПроцедуры

	
	// Обработчик заполнения документа на основании Заказа покупателя.
	//
	// Параметры:
	//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
	//
	Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения, Операция = "") Экспорт
		
		Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.алк_ЗаказПокупателя") Тогда
			Возврат;	
		КонецЕсли;
		
		// Заполнение шапки документа.
		ЭтотОбъект.ДокументОснование 	= ДанныеЗаполнения.Ссылка;
		ЗаказПокупателя              	= ДанныеЗаполнения.Ссылка;
		Направление              		= ДанныеЗаполнения.Направление;
		Организация 					= ДанныеЗаполнения.Организация;
		
		//    можно заполнить табличную часть, но зачем? ...
		//Для каждого Стр Из  Цикл
		//
		//	
		//
		//КонецЦикла; 
		//НоваяСтрока = ЭтотОбъект[ИмяТабличнойЧасти].Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);

				
	КонецПроцедуры //ЗаполнитьПоЗаказуПокупателя()

	#КонецОбласти
	
	
	#Область СобытияОбъекта
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		//Данные = ЗаказПокупателя;
		//ПредставлениеПоЗаказуПокупателя = Данные.Наименование + " ("+ Данные.Контрагент + ")";		
		
	КонецПроцедуры
	
	#КонецОбласти 
	
#КонецЕсли
